disks/ssd/06_n2i1.log
4k_randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
4k_randread: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
64k_write: (g=2): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
64k_read: (g=3): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.7
Starting 8 processes
4k_randwrite: Laying out IO file (1 file / 5120MiB)
4k_randread: Laying out IO file (1 file / 5120MiB)
64k_write: Laying out IO file (1 file / 5120MiB)
64k_read: Laying out IO file (1 file / 5120MiB)

4k_randwrite: (groupid=0, jobs=2): err= 0: pid=271948: Fri Aug 14 09:21:08 2020
  write: IOPS=86.3k, BW=337MiB/s (353MB/s)(9.88GiB/30001msec)
    slat (nsec): min=2045, max=244765, avg=2987.25, stdev=955.29
    clat (nsec): min=831, max=13603k, avg=14832.75, stdev=22492.70
     lat (usec): min=9, max=13606, avg=17.87, stdev=22.66
    clat percentiles (nsec):
     |  1.00th=[ 9152],  5.00th=[ 9536], 10.00th=[ 9664], 20.00th=[ 9792],
     | 30.00th=[ 9920], 40.00th=[10816], 50.00th=[15936], 60.00th=[16768],
     | 70.00th=[17536], 80.00th=[18560], 90.00th=[20864], 95.00th=[22912],
     | 99.00th=[28544], 99.50th=[33536], 99.90th=[47872], 99.95th=[53504],
     | 99.99th=[67072]
   bw (  KiB/s): min=88664, max=299059, per=59.06%, avg=203844.60, stdev=71089.56, samples=94
   iops        : min=22166, max=74764, avg=50960.86, stdev=17772.41, samples=94
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=30.96%, 20=56.15%, 50=12.82%
  lat (usec)   : 100=0.07%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=12.14%, sys=22.19%, ctx=2588847, majf=0, minf=171
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2588846,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
4k_randread: (groupid=1, jobs=2): err= 0: pid=271952: Fri Aug 14 09:21:08 2020
   read: IOPS=19.3k, BW=75.3MiB/s (78.0MB/s)(2260MiB/30001msec)
    slat (usec): min=2, max=395, avg= 7.61, stdev= 1.37
    clat (usec): min=3, max=2881, avg=94.32, stdev=14.01
     lat (usec): min=47, max=2889, avg=102.11, stdev=14.05
    clat percentiles (usec):
     |  1.00th=[   77],  5.00th=[   81], 10.00th=[   85], 20.00th=[   86],
     | 30.00th=[   87], 40.00th=[   88], 50.00th=[   93], 60.00th=[  101],
     | 70.00th=[  102], 80.00th=[  103], 90.00th=[  105], 95.00th=[  106],
     | 99.00th=[  122], 99.50th=[  127], 99.90th=[  153], 99.95th=[  161],
     | 99.99th=[  172]
   bw (  KiB/s): min=27287, max=38678, per=36.16%, avg=27889.66, stdev=1410.45, samples=118
   iops        : min= 6821, max= 9669, avg=6972.07, stdev=352.58, samples=118
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%, 100=58.27%
  lat (usec)   : 250=41.71%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=4.34%, sys=8.82%, ctx=578523, majf=0, minf=96
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=578529,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
64k_write: (groupid=2, jobs=2): err= 0: pid=271954: Fri Aug 14 09:21:08 2020
  write: IOPS=23.7k, BW=1481MiB/s (1553MB/s)(10.0GiB/6916msec)
    slat (usec): min=3, max=432, avg=12.28, stdev= 4.50
    clat (usec): min=3, max=13654, avg=69.22, stdev=169.19
     lat (usec): min=34, max=13670, avg=81.63, stdev=169.38
    clat percentiles (usec):
     |  1.00th=[   32],  5.00th=[   36], 10.00th=[   38], 20.00th=[   40],
     | 30.00th=[   42], 40.00th=[   44], 50.00th=[   47], 60.00th=[   48],
     | 70.00th=[   52], 80.00th=[   57], 90.00th=[   76], 95.00th=[  143],
     | 99.00th=[  725], 99.50th=[ 1020], 99.90th=[ 1467], 99.95th=[ 1614],
     | 99.99th=[ 9241]
   bw (  KiB/s): min=526167, max=832295, per=39.53%, avg=599364.20, stdev=61878.13, samples=25
   iops        : min= 8221, max=13004, avg=9364.60, stdev=966.82, samples=25
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=66.75%, 100=25.99%
  lat (usec)   : 250=4.80%, 500=0.97%, 750=0.52%, 1000=0.43%
  lat (msec)   : 2=0.51%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=7.35%, sys=15.63%, ctx=163840, majf=0, minf=53
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,163840,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
64k_read: (groupid=3, jobs=2): err= 0: pid=271956: Fri Aug 14 09:21:08 2020
   read: IOPS=7677, BW=480MiB/s (503MB/s)(10.0GiB/21341msec)
    slat (usec): min=3, max=317, avg=13.85, stdev= 2.30
    clat (usec): min=4, max=3062, avg=244.94, stdev=67.06
     lat (usec): min=48, max=3076, avg=259.00, stdev=66.35
    clat percentiles (usec):
     |  1.00th=[  163],  5.00th=[  169], 10.00th=[  174], 20.00th=[  182],
     | 30.00th=[  192], 40.00th=[  212], 50.00th=[  237], 60.00th=[  260],
     | 70.00th=[  285], 80.00th=[  310], 90.00th=[  322], 95.00th=[  347],
     | 99.00th=[  429], 99.50th=[  465], 99.90th=[  570], 99.95th=[  644],
     | 99.99th=[  758]
   bw (  KiB/s): min=238208, max=251392, per=49.96%, avg=245478.86, stdev=3043.85, samples=84
   iops        : min= 3722, max= 3928, avg=3835.60, stdev=47.56, samples=84
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.12%, 100=0.01%, 250=56.75%
  lat (usec)   : 500=42.88%, 750=0.24%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=1.78%, sys=5.93%, ctx=163839, majf=0, minf=89
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=163840,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=337MiB/s (353MB/s), 337MiB/s-337MiB/s (353MB/s-353MB/s), io=9.88GiB (10.6GB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=75.3MiB/s (78.0MB/s), 75.3MiB/s-75.3MiB/s (78.0MB/s-78.0MB/s), io=2260MiB (2370MB), run=30001-30001msec

Run status group 2 (all jobs):
  WRITE: bw=1481MiB/s (1553MB/s), 1481MiB/s-1481MiB/s (1553MB/s-1553MB/s), io=10.0GiB (10.7GB), run=6916-6916msec

Run status group 3 (all jobs):
   READ: bw=480MiB/s (503MB/s), 480MiB/s-480MiB/s (503MB/s-503MB/s), io=10.0GiB (10.7GB), run=21341-21341msec

Disk stats (read/write):
  nvme0n1: ios=822806/2835584, merge=0/19, ticks=105773/36254, in_queue=1312, util=97.62%